Repository: python/pootle-python-org-backup
Catalog: tmxes/fr/documenting.tmx
Source language: en
Languages: fr

source: Building the documentation
fr: Construire la documentation

source: You need to have Python 2.4 or higher installed; the toolset used to build the docs is written in Python. It is called *Sphinx*, it is not included in this tree, but maintained separately. Also needed are the docutils, supplying the base markup that Sphinx uses, Jinja, a templating engine, and optionally Pygments, a code highlighter.
fr: If vous faut Python 2.4 ou supérieur d’installé ; l’outil utilisé pour construire la documentation est écrit en Python. Il s’appele *Sphinx*, il n'est pas inclus dans cette arborescence mais maintenu séparément. Il faut également docutils, qui fournit le système de balisage de base utilisé par Sphinx, Jinja, un moteur de templates, et facultativement Pygments, un outil de coloration syntaxique.

source: Using make
fr: Utiliser make

source: Luckily, a Makefile has been prepared so that on Unix, provided you have installed Python and Subversion, you can just run ::
fr: Heureusement un fichier Makefile existe, de façon à ce que sous Unix, si vous avez installé Python et Subversion, vous puissiez lancer ::

source: Available make targets are:
fr: Les différentes cibles de make sont :

source: "html", which builds standalone HTML files for offline viewing.
fr: "html", qui construit les fichiers HTML permettant une consultation en mode déconnecté.

source: To create the CHM file, you need to run the Microsoft HTML Help Workshop over the generated project (.hhp) file.
fr: Pour créer le fichier CHM, vous devez exécuter le Microsoft HTML Help Workshop sur le projet a généré (fichier .hhp).

source: You'll need to install the Sphinx package, either by checking it out via ::
fr: Vous aurez besoin d'installer le paquet Sphinx, avec la commande suivante::
